k6-stresstest-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5000 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 5000 looping VUs for 1m20s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.6s), 0007/5000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0007/5000 VUs  0m00.6s/1m20.0s

running (0m01.6s), 0016/5000 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 0016/5000 VUs  0m01.6s/1m20.0s

running (0m02.6s), 0026/5000 VUs, 22 complete and 0 interrupted iterations
default   [   3% ] 0026/5000 VUs  0m02.6s/1m20.0s

running (0m03.6s), 0036/5000 VUs, 48 complete and 0 interrupted iterations
default   [   5% ] 0036/5000 VUs  0m03.6s/1m20.0s

running (0m04.6s), 0046/5000 VUs, 84 complete and 0 interrupted iterations
default   [   6% ] 0046/5000 VUs  0m04.6s/1m20.0s

running (0m05.6s), 0056/5000 VUs, 130 complete and 0 interrupted iterations
default   [   7% ] 0056/5000 VUs  0m05.6s/1m20.0s

running (0m06.6s), 0066/5000 VUs, 186 complete and 0 interrupted iterations
default   [   8% ] 0066/5000 VUs  0m06.6s/1m20.0s

running (0m07.6s), 0076/5000 VUs, 252 complete and 0 interrupted iterations
default   [  10% ] 0076/5000 VUs  0m07.6s/1m20.0s

running (0m08.6s), 0086/5000 VUs, 328 complete and 0 interrupted iterations
default   [  11% ] 0086/5000 VUs  0m08.6s/1m20.0s

running (0m09.6s), 0096/5000 VUs, 414 complete and 0 interrupted iterations
default   [  12% ] 0096/5000 VUs  0m09.6s/1m20.0s

running (0m10.6s), 0127/5000 VUs, 510 complete and 0 interrupted iterations
default   [  13% ] 0127/5000 VUs  0m10.6s/1m20.0s

running (0m11.6s), 0172/5000 VUs, 637 complete and 0 interrupted iterations
default   [  15% ] 0172/5000 VUs  0m11.6s/1m20.0s

running (0m12.6s), 0217/5000 VUs, 809 complete and 0 interrupted iterations
default   [  16% ] 0217/5000 VUs  0m12.6s/1m20.0s

running (0m13.6s), 0262/5000 VUs, 1026 complete and 0 interrupted iterations
default   [  17% ] 0262/5000 VUs  0m13.6s/1m20.0s

running (0m14.6s), 0307/5000 VUs, 1288 complete and 0 interrupted iterations
default   [  18% ] 0307/5000 VUs  0m14.6s/1m20.0s

running (0m15.6s), 0352/5000 VUs, 1595 complete and 0 interrupted iterations
default   [  20% ] 0352/5000 VUs  0m15.6s/1m20.0s

running (0m16.6s), 0397/5000 VUs, 1947 complete and 0 interrupted iterations
default   [  21% ] 0397/5000 VUs  0m16.6s/1m20.0s

running (0m17.6s), 0442/5000 VUs, 2344 complete and 0 interrupted iterations
default   [  22% ] 0442/5000 VUs  0m17.6s/1m20.0s

running (0m18.6s), 0487/5000 VUs, 2786 complete and 0 interrupted iterations
default   [  23% ] 0487/5000 VUs  0m18.6s/1m20.0s

running (0m19.6s), 0532/5000 VUs, 3270 complete and 0 interrupted iterations
default   [  25% ] 0532/5000 VUs  0m19.6s/1m20.0s

running (0m20.6s), 0577/5000 VUs, 3802 complete and 0 interrupted iterations
default   [  26% ] 0577/5000 VUs  0m20.6s/1m20.0s

running (0m21.6s), 0622/5000 VUs, 4375 complete and 0 interrupted iterations
default   [  27% ] 0622/5000 VUs  0m21.6s/1m20.0s

running (0m22.6s), 0667/5000 VUs, 4996 complete and 0 interrupted iterations
default   [  28% ] 0667/5000 VUs  0m22.6s/1m20.0s

running (0m23.6s), 0712/5000 VUs, 5663 complete and 0 interrupted iterations
default   [  30% ] 0712/5000 VUs  0m23.6s/1m20.0s

running (0m24.6s), 0757/5000 VUs, 6375 complete and 0 interrupted iterations
default   [  31% ] 0757/5000 VUs  0m24.6s/1m20.0s

running (0m25.6s), 0802/5000 VUs, 7132 complete and 0 interrupted iterations
default   [  32% ] 0802/5000 VUs  0m25.6s/1m20.0s

running (0m26.6s), 0847/5000 VUs, 7931 complete and 0 interrupted iterations
default   [  33% ] 0847/5000 VUs  0m26.6s/1m20.0s

running (0m27.6s), 0892/5000 VUs, 8777 complete and 0 interrupted iterations
default   [  35% ] 0892/5000 VUs  0m27.6s/1m20.0s

running (0m28.6s), 0937/5000 VUs, 9667 complete and 0 interrupted iterations
default   [  36% ] 0937/5000 VUs  0m28.6s/1m20.0s

running (0m29.6s), 0982/5000 VUs, 10603 complete and 0 interrupted iterations
default   [  37% ] 0982/5000 VUs  0m29.6s/1m20.0s

running (0m30.6s), 1060/5000 VUs, 11584 complete and 0 interrupted iterations
default   [  38% ] 1060/5000 VUs  0m30.6s/1m20.0s

running (0m31.6s), 1160/5000 VUs, 12644 complete and 0 interrupted iterations
default   [  40% ] 1160/5000 VUs  0m31.6s/1m20.0s

running (0m32.6s), 1260/5000 VUs, 13803 complete and 0 interrupted iterations
default   [  41% ] 1260/5000 VUs  0m32.6s/1m20.0s

running (0m33.6s), 1360/5000 VUs, 15063 complete and 0 interrupted iterations
default   [  42% ] 1360/5000 VUs  0m33.6s/1m20.0s

running (0m34.6s), 1460/5000 VUs, 16422 complete and 0 interrupted iterations
default   [  43% ] 1460/5000 VUs  0m34.6s/1m20.0s

running (0m35.6s), 1560/5000 VUs, 17882 complete and 0 interrupted iterations
default   [  45% ] 1560/5000 VUs  0m35.6s/1m20.0s

running (0m36.6s), 1660/5000 VUs, 19433 complete and 0 interrupted iterations
default   [  46% ] 1660/5000 VUs  0m36.6s/1m20.0s

running (0m37.6s), 1760/5000 VUs, 21091 complete and 0 interrupted iterations
default   [  47% ] 1760/5000 VUs  0m37.6s/1m20.0s

running (0m38.6s), 1860/5000 VUs, 22850 complete and 0 interrupted iterations
default   [  48% ] 1860/5000 VUs  0m38.6s/1m20.0s

running (0m39.6s), 1960/5000 VUs, 24705 complete and 0 interrupted iterations
default   [  50% ] 1960/5000 VUs  0m39.6s/1m20.0s

running (0m40.6s), 2060/5000 VUs, 26658 complete and 0 interrupted iterations
default   [  51% ] 2060/5000 VUs  0m40.6s/1m20.0s

running (0m41.6s), 2160/5000 VUs, 28711 complete and 0 interrupted iterations
default   [  52% ] 2160/5000 VUs  0m41.6s/1m20.0s

running (0m42.6s), 2260/5000 VUs, 30871 complete and 0 interrupted iterations
default   [  53% ] 2260/5000 VUs  0m42.6s/1m20.0s

running (0m43.6s), 2360/5000 VUs, 33131 complete and 0 interrupted iterations
default   [  55% ] 2360/5000 VUs  0m43.6s/1m20.0s

running (0m44.6s), 2460/5000 VUs, 35491 complete and 0 interrupted iterations
default   [  56% ] 2460/5000 VUs  0m44.6s/1m20.0s

running (0m45.6s), 2560/5000 VUs, 37946 complete and 0 interrupted iterations
default   [  57% ] 2560/5000 VUs  0m45.6s/1m20.0s

running (0m46.6s), 2660/5000 VUs, 40499 complete and 0 interrupted iterations
default   [  58% ] 2660/5000 VUs  0m46.6s/1m20.0s

running (0m47.6s), 2760/5000 VUs, 43151 complete and 0 interrupted iterations
default   [  60% ] 2760/5000 VUs  0m47.6s/1m20.0s

running (0m48.6s), 2860/5000 VUs, 45905 complete and 0 interrupted iterations
default   [  61% ] 2860/5000 VUs  0m48.6s/1m20.0s

running (0m49.6s), 2960/5000 VUs, 48764 complete and 0 interrupted iterations
default   [  62% ] 2960/5000 VUs  0m49.6s/1m20.0s

running (0m50.6s), 3060/5000 VUs, 51724 complete and 0 interrupted iterations
default   [  63% ] 3060/5000 VUs  0m50.6s/1m20.0s

running (0m51.6s), 3160/5000 VUs, 54784 complete and 0 interrupted iterations
default   [  65% ] 3160/5000 VUs  0m51.6s/1m20.0s

running (0m52.6s), 3260/5000 VUs, 57935 complete and 0 interrupted iterations
default   [  66% ] 3260/5000 VUs  0m52.6s/1m20.0s

running (0m53.6s), 3360/5000 VUs, 61195 complete and 0 interrupted iterations
default   [  67% ] 3360/5000 VUs  0m53.6s/1m20.0s

running (0m54.6s), 3460/5000 VUs, 64555 complete and 0 interrupted iterations
default   [  68% ] 3460/5000 VUs  0m54.6s/1m20.0s

running (0m55.6s), 3560/5000 VUs, 68002 complete and 0 interrupted iterations
default   [  70% ] 3560/5000 VUs  0m55.6s/1m20.0s

running (0m56.6s), 3660/5000 VUs, 71552 complete and 0 interrupted iterations
default   [  71% ] 3660/5000 VUs  0m56.6s/1m20.0s

running (0m57.6s), 3760/5000 VUs, 75209 complete and 0 interrupted iterations
default   [  72% ] 3760/5000 VUs  0m57.6s/1m20.0s

running (0m58.6s), 3860/5000 VUs, 78963 complete and 0 interrupted iterations
default   [  73% ] 3860/5000 VUs  0m58.6s/1m20.0s

running (0m59.6s), 3960/5000 VUs, 82812 complete and 0 interrupted iterations
default   [  75% ] 3960/5000 VUs  0m59.6s/1m20.0s

running (1m00.6s), 4060/5000 VUs, 86755 complete and 0 interrupted iterations
default   [  76% ] 4060/5000 VUs  1m00.6s/1m20.0s

running (1m01.6s), 4160/5000 VUs, 90811 complete and 0 interrupted iterations
default   [  77% ] 4160/5000 VUs  1m01.6s/1m20.0s

running (1m02.6s), 4260/5000 VUs, 94950 complete and 0 interrupted iterations
default   [  78% ] 4260/5000 VUs  1m02.6s/1m20.0s

running (1m03.6s), 4360/5000 VUs, 99201 complete and 0 interrupted iterations
default   [  80% ] 4360/5000 VUs  1m03.6s/1m20.0s

running (1m04.6s), 4460/5000 VUs, 103555 complete and 0 interrupted iterations
default   [  81% ] 4460/5000 VUs  1m04.6s/1m20.0s

running (1m05.6s), 4560/5000 VUs, 108026 complete and 0 interrupted iterations
default   [  82% ] 4560/5000 VUs  1m05.6s/1m20.0s

running (1m06.6s), 4660/5000 VUs, 112180 complete and 0 interrupted iterations
default   [  83% ] 4660/5000 VUs  1m06.6s/1m20.0s

running (1m07.6s), 4760/5000 VUs, 116839 complete and 0 interrupted iterations
default   [  85% ] 4760/5000 VUs  1m07.6s/1m20.0s

running (1m08.6s), 4860/5000 VUs, 121082 complete and 0 interrupted iterations
default   [  86% ] 4860/5000 VUs  1m08.6s/1m20.0s

running (1m09.6s), 4960/5000 VUs, 125932 complete and 0 interrupted iterations
default   [  87% ] 4960/5000 VUs  1m09.6s/1m20.0s

running (1m10.6s), 4930/5000 VUs, 130838 complete and 0 interrupted iterations
default   [  88% ] 4930/5000 VUs  1m10.6s/1m20.0s

running (1m11.6s), 4416/5000 VUs, 135767 complete and 0 interrupted iterations
default   [  90% ] 4416/5000 VUs  1m11.6s/1m20.0s

running (1m12.6s), 3924/5000 VUs, 140183 complete and 0 interrupted iterations
default   [  91% ] 3924/5000 VUs  1m12.6s/1m20.0s

running (1m13.6s), 3421/5000 VUs, 144106 complete and 0 interrupted iterations
default   [  92% ] 3421/5000 VUs  1m13.6s/1m20.0s

running (1m14.6s), 2917/5000 VUs, 147527 complete and 0 interrupted iterations
default   [  93% ] 2917/5000 VUs  1m14.6s/1m20.0s

running (1m15.6s), 2418/5000 VUs, 150444 complete and 0 interrupted iterations
default   [  95% ] 2418/5000 VUs  1m15.6s/1m20.0s

running (1m16.6s), 1914/5000 VUs, 152861 complete and 0 interrupted iterations
default   [  96% ] 1914/5000 VUs  1m16.6s/1m20.0s

running (1m17.6s), 1410/5000 VUs, 154775 complete and 0 interrupted iterations
default   [  97% ] 1410/5000 VUs  1m17.6s/1m20.0s

running (1m18.6s), 0912/5000 VUs, 156185 complete and 0 interrupted iterations
default   [  98% ] 0912/5000 VUs  1m18.6s/1m20.0s

running (1m19.6s), 0408/5000 VUs, 157097 complete and 0 interrupted iterations
default   [ 100% ] 0408/5000 VUs  1m19.6s/1m20.0s

running (1m20.6s), 0023/5000 VUs, 157505 complete and 0 interrupted iterations
default ↓ [ 100% ] 0249/5000 VUs  1m20s


  █ TOTAL RESULTS 

    checks_total.......: 315056  3890.234974/s
    checks_succeeded...: 100.00% 315056 out of 315056
    checks_failed......: 0.00%   0 out of 315056

    ✓ status is 200
    ✓ status is ok

    HTTP
    http_req_duration..............: avg=9.21ms min=79.39µs med=679.17µs max=825.94ms p(90)=12.45ms p(95)=66.04ms
      { expected_response:true }...: avg=9.21ms min=79.39µs med=679.17µs max=825.94ms p(90)=12.45ms p(95)=66.04ms
    http_req_failed................: 0.00%  0 out of 157528
    http_reqs......................: 157528 1945.117487/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s       max=1.82s    p(90)=1.01s   p(95)=1.06s  
    iterations.....................: 157528 1945.117487/s
    vus............................: 23     min=7           max=4960
    vus_max........................: 5000   min=5000        max=5000

    NETWORK
    data_received..................: 48 MB  589 kB/s
    data_sent......................: 13 MB  161 kB/s



running (1m21.0s), 0000/5000 VUs, 157528 complete and 0 interrupted iterations
default ✓ [ 100% ] 0000/5000 VUs  1m20s